In [1]:
import pandas as pd

In [7]:
# creating series
series1 = pd.Series([1,2,3,4], index=["a",'b','c','d'])

In [8]:
series1

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
type(series1)

pandas.core.series.Series

In [11]:
dict1 = {"a":"A", "b":"B","c":"C","d":"D"}

In [12]:
series2 = pd.Series(dict1)

In [13]:
series2

a    A
b    B
c    C
d    D
dtype: object

In [14]:
# DATAFRAME

In [17]:
DATA = {
    "CALORIES" : [43,34,56,54,32],
    "Duration": [11,23,45,43,32]
}

In [21]:
df = pd.DataFrame(DATA, index=["day1","day2","day3","day4","day5"])

In [22]:
df

      CALORIES  Duration
day1        43        11
day2        34        23
day3        56        45
day4        54        43
day5        32        32

In [20]:
type(df)

pandas.core.frame.DataFrame

In [25]:
df.loc['day2']

CALORIES    34
Duration    23
Name: day2, dtype: int64

In [27]:
# READ CSV FILES
# COMMA SEPERATED VALUES

In [28]:
df1 = pd.read_csv('iris.csv')

In [29]:
df1.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [32]:
df1.sample(5)

     sepal.length  sepal.width  petal.length  petal.width     variety
45            4.8          3.0           1.4          0.3      Setosa
144           6.7          3.3           5.7          2.5   Virginica
51            6.4          3.2           4.5          1.5  Versicolor
3             4.6          3.1           1.5          0.2      Setosa
58            6.6          2.9           4.6          1.3  Versicolor

In [34]:
df1.shape

(150, 5)

In [38]:
df1['sepal.length']

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal.length, Length: 150, dtype: float64

In [39]:
df1['variety'].value_counts()

variety
Setosa        50
Versicolor    50
Virginica     50
Name: count, dtype: int64

In [40]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal.length  150 non-null    float64
 1   sepal.width   150 non-null    float64
 2   petal.length  150 non-null    float64
 3   petal.width   150 non-null    float64
 4   variety       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [41]:
# JOIN DATAFRAMES

In [44]:
df2 = pd.DataFrame({
    "X" : [1,2,3,4,5],
    "Y" : [6,7,8,9,10]

})

In [43]:
df3 = pd.DataFrame({
    "X" : [11,12,13,14,15],
    "Y" : [16,17,18,19,20]

})

In [45]:
df2,df3

(   X   Y
 0  1   6
 1  2   7
 2  3   8
 3  4   9
 4  5  10,
     X   Y
 0  11  16
 1  12  17
 2  13  18
 3  14  19
 4  15  20)

In [46]:
df2

   X   Y
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [53]:
df4 = pd.concat((df2,df3), ignore_index=True)

In [54]:
df4

    X   Y
0   1   6
1   2   7
2   3   8
3   4   9
4   5  10
5  11  16
6  12  17
7  13  18
8  14  19
9  15  20

In [55]:
# apply a function to a dataframe

In [57]:
data = {
    "Product" : ["A","B","C","D"],
    "Quantity" : [10,20,30,50],
    "Price" : [30,50,60,70]
}
df = pd.DataFrame(data)

In [58]:
df

  Product  Quantity  Price
0       A        10     30
1       B        20     50
2       C        30     60
3       D        50     70

In [59]:
def total_price_calculate(row):
    return row["Quantity"] * row["Price"]

In [60]:
df["Total"] = total_price_calculate(df)

In [61]:
df

  Product  Quantity  Price  Total
0       A        10     30    300
1       B        20     50   1000
2       C        30     60   1800
3       D        50     70   3500

In [62]:
# Renaming the column name

In [63]:
df1

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [67]:
df1 = df1.rename(columns= {"variety" : "Flower Name"})

In [68]:
df1

     sepal.length  sepal.width  petal.length  petal.width Flower Name
0             5.1          3.5           1.4          0.2      Setosa
1             4.9          3.0           1.4          0.2      Setosa
2             4.7          3.2           1.3          0.2      Setosa
3             4.6          3.1           1.5          0.2      Setosa
4             5.0          3.6           1.4          0.2      Setosa
..            ...          ...           ...          ...         ...
145           6.7          3.0           5.2          2.3   Virginica
146           6.3          2.5           5.0          1.9   Virginica
147           6.5          3.0           5.2          2.0   Virginica
148           6.2          3.4           5.4          2.3   Virginica
149           5.9          3.0           5.1          1.8   Virginica

[150 rows x 5 columns]